Public Member Functions | Friends | List of all members
ACAPI::Library::v1::Library Class Referencefinal
Library Management
Library is the representation of an item in the library list of an ArchiCAD project. More...
#include <Library.hpp>
 Inheritance diagram for ACAPI::Library::v1::Library:
 Public Member Functions
ACAPI::Result< GS::UniString >  | GetName () const
The name of the library.
ACAPI::Result< IO::Location >  | GetLocation () const
Location of the Library. If the library is a teamwork library, the location is the local cache location.
ACAPI::Result< GS::UniString >  | GetTWServerUrl () const
The teamwork server URL is the URL of the BIMcloud where the library is located, like "http://example.com".
ACAPI::Result< GS::UniString >  | GetTWServerPath () const
The relative location of the library from the root of the BIMcloud server, like "Libraries/The shared library.lcf".
ACAPI::Result< bool >  | IsLocal () const
The library is loaded from local (or netwrork) file system.
ACAPI::Result< bool >  | IsBuiltIn () const
The library is built-in, if it is the Archicad's or any add-ons built-in library.
ACAPI::Result< bool >  | IsEmbedded () const
The library is embedded, if it is the one embedded in the plan file.
ACAPI::Result< bool >  | IsServer () const
The library is a server library, if it is loaded from a BIMcloud server.
ACAPI::Result< bool >  | IsPackage () const
The library is a library package, if it is a .libpack file.
ACAPI::Result< GS::Guid >  | GetPackageID () const
The package ID of the library package.
ACAPI::Result< UInt32 >  | GetPackageMainVersion () const
The main version of the library package. Different main versions are incompatible and have different package IDs.
ACAPI::Result< UInt32 >  | GetPackageSubVersion () const
The sub version of the library package.
ACAPI::Result< UInt32 >  | GetPackageMinACVersion () const
The minimum Archicad version of the library package.
ACAPI::Result< UInt32 >  | GetPackageMinACBuildNumber () const
The minimum Archicad build number of the library package.
ACAPI::Result< std::vector< std::tuple< GS::UniString, GS::Guid, UInt32 > > >  | GetPackageDependencies () const
The dependencies of the library package. The dependencies are a list of name, package ID, subversion tuple.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | Impl::LibraryManagerImpl
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
Library is the representation of an item in the library list of an ArchiCAD project.
Since
Archicad 28